Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/memtrad-tecnicasTA-usosTA.tmx
Source language: ca
Languages: es_es

source: A l'hora d'abordar l'automatització del procés de traducció cal fer una anàlisis dels costos de traducció per tal d'estimar l'estalvi en recursos (com ara temps i diners) que es produirà amb la introducció de la traducció automàtica.
es_es: A la hora de abordar la automatización del proceso de traducción hay que hacer un análisis de los costes de traducción para estimar el ahorro en recursos (como por ejemplo tiempo y dinero) que se producirá con la introducción de la traducción automática.

source: A l'hora de posteditar hem d'evitar fer canvis preferencials (aquesta solució adequada ``m'agrada més'' que aquesta altra que també és adequada).
es_es: A la hora de posteditar tenemos que evitar hacer cambios preferenciales (esta solución adecuada ``me gusta más'' que esta otra que también es adecuada).

source: A l'hora de preeditar un text per a traduir-lo automàticament convé usar frases curtes.
es_es: A la hora de preeditar un texto para traducirlo automáticamente conviene usar frases cortas.

source: A l'hora de traduir hi ha una diferència fonamental entre els sistemes basats en regles o coneixement i els sistemes estadístics: mentres que els sistemes basat en regles produeixen únicament una traducció, els sistemes estadístics generen una gran quantitat d'hipòtesis de traducció (idealment totes les possibles) i utilitzen models estadístics per puntuar les hipòtesis generades i escollir la millor de totes.
es_es: A la hora de traducir hay una diferencia fundamental entre los sistemas basados en reglas o conocimiento y los sistemas estadísticos: mientras que los sistemas basados en reglas producen únicamente una traducción, los sistemas estadísticos generan una gran cantidad de hipótesis de traducción (idealmente todas las posibles) y utilizan modelos estadísticos para puntuar las hipótesis generadas y escoger la mejor de todas.

source: A més del lèxic, PACE també especifica la sintaxi .
es_es: Además del léxico, PACE también especifica la sintaxis .

source: A més té en compte, tot i que indirectament, el context en què apareixen les paraules en LM, de manera que assigna una versemblança major a l'oració en espanyol (LM) No piensa con la cabeza que a l'oració No piensa con el cabo, on els segments la cabeza i el cabo són dues possibles traduccions del segment en català el cap que apareix en l'oració en LO No pensa amb el cap.
es_es: Además, tiene en cuenta, a pesar de que indirectamente, el contexto en el que aparecen las palabras en LM, de forma que asigna una verosimilitud mayor a la oración en español (LM) No piensa con la cabeza que a la oración No piensa con el cabo, donde los segmentos la cabeza y el cabo son dos posibles traducciones del segmento en catalán el cap que aparece en la oración en LO No pensa amb el cap.

source: A més, es requereix que es puguen afegir fàcilment altres llengües com l'occità, el sard o l'asturià.
es_es: Además, se requiere que se puedan añadir fácilmente otras lenguas como el occitano, el sardo o el asturiano.

source: A pesar d'això, la traducció mot per mot no és practicable perquè el gènere i el nombre gramatical d'alguns substantius varia i els adjectius, articles, etc., que l'acompanyen no concordarien correctament: cast. { una señal muy clara} $$ cat.
es_es: A pesar de esto, la traducción palabra por palabra no es practicable porque el género y el número gramatical de algunos sustantivos varía y los adjetivos, artículos, etc. que lo acompañan no concordarían correctamente: cast. { una señal muy clara} $$ cat.

source: A pesar que tant el primer mot com el segon mot de cada parell tenen freqüències similars, en algun cas les freqüències d'aparició conjunta són molt elevades i en uns altres casos són molt més reduïdes.
es_es: A pesar de que tanto la primera palabra como la segunda palabra de cada par tienen frecuencias similares, en algún caso las frecuencias de aparición conjunta son muy elevadas y en otros casos son mucho más reducidas.

source: A tall d'exemple, considereu el següent text en tok pisin (el text està pres de {lyovin97b}): { Long taim bifo, wanpela ailan, draipela pik i save stap ya, na em i save kaikai ol man.
es_es: A modo de ejemplo, observad el siguiente texto en tok pisin (texto extraído de {lyovin97b}): { Long taim bifo, wanpela ailan, draipela pik i save stap ya, na em i save kaikai ol man.

source: Acció
es_es: Acción

source: Així només es visita una vegada cada mot de la frase.
es_es: Así sólo se visita una vez cada palabra de la frase.

source: Així, la tasca de postedició és molt més eficient, ja que en conéixer l'origen i la causa dels errors se'n fa més fàcil i ràpida la correcció.
es_es: Así, la tarea de postedición es mucho más eficiente, puesto que al conocer el origen y la causa de los errores se hace más fácil y rápida la corrección.

source: Això fa que els sistemes preferisquen les traduccions curtes.
es_es: Esto hace que los sistemas prefieran las traducciones cortas.

source: Això fa que, actualment, només s'hagen desenvolupat sistemes d'interlingua clàssics per a àmbits temàtics molt concrets.
es_es: Esto hace que, actualmente, sólo se hayan desarrollado sistemas de interlingua clásicos para ámbitos temáticos muy concretos.

source: Això s'aconsegueix, per exemple, eliminant l'ambigüitat del text,, evitant l'ús de la veu passiva, reduint l'ús d'oracions subordinades o usant frases curtes i completes sintàcticament i semànticament. ofereix indicacions per a escriure textos en anglés per a una audiència global, de manera que els textos siguen més fàcils d'entendre per als no natius i més fàcils de traduir manualment i automàticament.} La preedició del text origen es pot fer també per a marcar parts del text que no han de ser traduïdes, com ara una citació, o que han de ser tractades de manera especial per no ser frases completes, com un títol.
es_es: Esto se consigue, por ejemplo, eliminando la ambigüedad del texto,, evitando el uso de la voz pasiva, reduciendo el uso de oraciones subordinadas o usando frases cortas y completas sintácticamente y semánticamente. ofrece indicaciones para escribir textos en inglés para una audiencia global, de forma que los textos sean más fáciles de entender para los no nativos y más fáciles de traducir manualmente y automáticamente.} La preedición del texto origen se puede hacer también para marcar partes del texto que no tienen que ser traducidas, como por ejemplo una citación, o que tienen que ser tratadas de manera especial para no ser frases completas, como un título.

source: Això suggereix la necessitat d'una nova regla que detecte i reordene el patró llarg adjectiu--substantiu--substantiu--substantiu, per exemple: [$R_3$] (en) adj subst$_1$ subst$_2$ subst$_3$ $$ (ca) subst$_3$ adj prepde subst$_2$ prepde subst$_1$ Aquesta regla podria reordenar correctament aquesta seqüència de quatre mots.
es_es: Eso sugiere la necesidad de una nueva regla que detecte y reordene el patrón largo adjectivo--sustantivo--sustantivo--sustantivo, por ejemplo: [$R_3$] (en) adj sust$_1$ sust$_2$ sust$_3$ $$(ca) sust$_3$ adj prepde sust$_2$ prepde sust$_1$ Esta regla podría reordenar correctamente esta secuencia de cuatro palabras.

source: Al final dels 1980 comença l'aplicació de tècniques d'intel·ligència artificial al processament del llenguatge humà (sistemes experts i sistemes basats en el coneixement dissenyats per entendre els textos).
es_es: A finales de los 80 empieza la aplicación de técnicas de inteligencia artificial al procesamiento del lenguaje humano (sistemas expertos y sistemas basados en el conocimiento diseñados para entender los textos).

source: Al llarg dels darrers anys, amb la generalització de l'ús d'Internet, s'han desenvolupat serveis de traducció disponibles en línia, com ara Google Translate, {http://translate.google.com} o Bing Translator, {http://translator.bing.com}, d'ús molt comú per part del públic en general per a l'assimilació (vegeu l'apartat ) de continguts web escrits en altres llengües i fins i tot per a la traducció de cartells i textos fotografiats amb la càmera del telèfon mòbil.
es_es: A lo largo de los últimos años, con la generalización del uso de Internet, se han desarrollado servicios de traducción disponibles en linea, como por ejemplo, Google Translate, {http://translate.google.com} o Bing Translator, {http://translator.bing.com}, de uso muy común por parte del público en general para la asimilación (véase el apartado ) de contenidos web escritos en otras lenguas e incluso para la traducción de carteles y textos fotografiados con la cámara del teléfono móvil.

source: Algunes traduccions són errònies perquè el sistema no té un catàleg massa complet de regles.
es_es: Algunas traducciones son erroneas porque el sistema no tiene un catálago demasiado completo de reglas.

source: Alguns dels avantatges de l'ús de llenguatges controlats {schwitten07u} es poden resumir com segueix: els textos són més senzills i intel·ligibles; el manteniment dels documents es facilita; se simplifica el tractament computacional dels documents, en particular la traducció automàtica.
es_es: Algunas de las ventajas del uso de lenguajes controlados {schwitten07uno} se pueden resumir como sigue: los textos son más sencillos e inteligibles; el mantenimiento de los documentos se facilita; se simplifica el tratamiento computacional de los documentos, en particular la traducción automática.

source: Alguns sistemes de transferència morfològica avançada disponibles en Internet són: SDL Transcend ({http://www.freetranslation.com
es_es: Algunos sistemas de transferencia morfológica avanzada disponibles en Internet son: SDL Transcend ({http://www.freetranslation.com

source: Als 1990, però, apareixen noves estratègies conegudes com a mètodes basats en corpus.
es_es: En los 90, en cambio, aparecen nuevas estrategias conocidas como métodos basados en corpus.

source: Altres eines ---d'ús comú entre diversos traductors, i accessibles normalment com a recursos remots--- poden ser les bases de dades terminològiques i les bases de dades lèxiques multilingües (vegeu l'epígraf ), o les memòries de traducció (vegeu el capítol ).
es_es: Otras herramientas ---de uso común entre varios traductores, y accesibles normalmente como recursos remotos--- pueden ser las bases de datos terminológicas y las bases de datos léxicas multilingües (véase el epígrafe ), o las memorias de traducción (véase el capítulo ).

source: Altres exemples d'ús de la traducció automàtica per a l'assimilació són: La traducció automàtica de correu electrònic entre les persones d'un grup de treball internacional amb la finalitat d'agilitzar les comunicacions.
es_es: Otros ejemplos de uso de la traducción automática para la asimilación son: La traducción automática del correo electrónico entre las personas de un grupo de trabajo internacional con la finalidad de agilizar las comunicaciones.

source: Altres exemples de llenguatges controlats són l'ScaniaSwedish usat per la firma de camions i autobusos Scania {almqvist96p}, o el { Caterpillar Technical English} de la companyia de maquinària d'excavació Caterpillar.
es_es: Otros ejemplos de lenguajes controlados son el ScaniaSwedish usado por la firma de camiones y autobuses Scania {almqvist96p}, o el { Caterpillar Technical English} de la compañía de maquinaria de excavación Caterpillar.

source: Altres llengües, com ara el neerlandés, usen un mot compost amb la paraula ordinador: Computervertaling.
es_es: Otras lenguas, como por ejemplo el neerlandés, usan una palabra compuesta con la palabra ordenador: Computervertaling.

source: Altres vegades es dóna el problema de l'ambigüitat lèxica categorial (vegeu l'apartat ): és a dir, el mot pot pertànyer a dues categories lèxiques diferents i cal usar informació sobre les categories morfològiques dels mots anteriors i posteriors (en absència d'informació sintàctica) per a desfer l'ambigüitat.
es_es: Otras veces se presenta el problema de la ambigüidad léxica categorial (veáse apartado ): es decir, la palabra puede pertenecer a dos categorías léxicas diferentes y es necesario usar información sobre las categorías morfológicas de las palabras anteriores y posteriores (en ausencia de información sintáctica) para deshacer la ambigüedad.

source: Altres voltes, el programa pot analitzar l'estructura profunda de la frase i presentar-ne les possibles interpretacions a l'autor, per tal que resolga alguna possible ambigüitat.
es_es: Otras veces, el programa puede analizar la estructura profunda de la frase y presentar las interpretaciones posibles al autor, para que resuelva alguna ambigüedad posible.

source: Anomenarem text informatitzat un fitxer que conté un text codificat en un format conegut (vegeu el capítol ), i que pot ser editat amb un editor o amb un processador de textos adequat.
es_es: Llamaremos texto informatizado a un fichero que contiene un texto codificado en un formato conocido (véase el capítulo ), y que puede ser editado con un editor o con un procesador de textos adecuado.

source: Aquest capítol descriu les tècniques o, dit d'una altra manera, les estratègies bàsiques usades pels programes de traducció automàtica.
es_es: Este capítulo describe las técnicas o, dicho de otra manera, las estrategias básicas usadas por los programas de traducción automática.

source: Aquest model usa les probabilitats de traducció entre els mots (un diccionari bilingüe probabilístic) per obtenir un indicador de la qualitat d'els segments bilingües.
es_es: Este modelo usa las probabilidades de traducción entre las palabras (un diccionario bilingüe probabilístico) para obtener un indicador de la calidad de los segmentos bilingües.

source: Aquest refinament es produeix perquè en cada iteració les probabilitats de la iteració anterior s'usen per acumular evidència en tot el corpus sobre la probabilitat de les correspondències entre mots i, a més, perquè els mots que són traducció mútua solen aparéixer junts en les mateixes oracions paral·leles, la qual cosa no succeeix si dos mots no són traducció un de l'altre.
es_es: Este refinamiento se produce porque en cada iteración las probabilidades de la iteración anterior se usan para acumular evidencia en todo el corpus sobre la probabilidad de las correspondencias entre palabras y, además, porque las palabras que son traducción mutua suelen aparecer juntas en las mismas oraciones paralelas, lo cual no sucede si dos palabras no son traducción una de la otra.

source: Aquest últim model l'usen els sistemes de traducció automàtica estadística basats en segments bilingües (en anglés phrase-based statistical machine translation; ), els quals són els més usats en l'actualitat.
es_es: Este último modelo lo usan los sistemas de traducción automática estadística basados en segmentos bilingües (en inglés phrase-based statistical machine translation; ), los cuales son los más usados en la actualidad.

source: Aquesta aplicació de la TA per a l'assimilació es pot veure en xats bilingües, o en els sistemes que tradueixen les pàgines web segons anem visitant-les seguint enllaços; en aquests sistemes, la TA no s'invoca explícitament, sinó implícitament quan usem el servei.
es_es: Esta aplicación de la TA para la asimilación se puede ver en chats bilingües, o en los sistemas que traducen las páginas web según vamos visitándolas siguiendo enlaces; en estos sistemas, la TA no se invoca explícitamente, sino implícitamente cuando usamos el servicio.

source: Aquesta aproximació exclou el tractament d'alguns aspectes de l'estructura del discurs.
es_es: Esta aproximación excluye el tratamiento de algunos aspectos de la estructura del discurso.

source: Aquesta aproximació pot no funcionar perquè de vegades les transformacions dels arbres depenen de la interpretació de mots concrets i de parts de l'oració.
es_es: Esta aproximación puede no funcionar porque a veces las transformaciones de los árboles dependen de la interpretación de palabras concretas y de partes de la oración.

source: Aquesta aproximació pot ser particularment útil quan les llengües entre les quals ha de traduir el sistema tenen una gran similitud sintàctica i semàntica, com en el cas de les llengües romàniques, amb l'excepció, potser, del romanés.
es_es: Esta aproximación puede ser particularmente útil cuando las lenguas entre las que tiene que traducir el sistema tienen una gran similitud sintáctica y semántica, como en el caso de las lenguas románicas, con la excepción, quizás, del rumano.

source: Aquesta combinació es fa assignant un pes (importància) a cada model que s'obté mitjançat un procés automàtic (tuning) que intenta maximitzar la qualitat de les traduccions proporcionades pel sistema en traduir un corpus de desenvolupament.
es_es: Esta combinación se hace asignando un peso (importancia) a cada modelo que se obtiene mediante un proceso automático (tuning) que intenta maximizar la calidad de las traducciones proporcionadas por el sistema al traducir un corpus de desarrollo.

source: Aquesta definició evita el concepte d'equi­va­lèn­cia i introdueix el d'interpretació com a conjunt de processos cognitius que tenen lloc en la ment del traductor.
es_es: Esta definición evita el concepto de equi­va­len­cia e introduce el de interpretación como conjunto de procesos cognitivos que tienen lugar en la mente del traductor.

source: Aquesta definició introdueix dues de les tres dimensions bàsiques d'un document escrit (original o traduït): el contingut (significat) i la forma (estil), però oblida el propòsit.
es_es: Esta definición introduce dos de las tres dimensiones básicas de un documento escrito (original o traducido): el contenido (significado) y la forma (estilo), pero olvida el propósito.

source: Aquesta hegemonia es deu en gran part a la disponibilitat de programari lliure/de codi font obert per a entrenar i aplicar sistemes de traducció automàtica, com ara Moses ({http://statmt.org/moses}).
es_es: Esta hegemonía se debe, en gran parte, a la disponibilidad de software libre/de código fuente abierto para entrenar y aplicar sistemas de traducción automática, como por ejemplo Moses ({http://statmt.org/moses}).

source: Aquesta i altres situacions de negociació del text d'origen amb l'usuari del sistema impliquen una interacció que també pot ajudar a preparar un text més correcte, és a dir, a preeditar-lo (vegeu l'apartat ) perquè puga ser traduït automàticament.
es_es: Esta y otras situaciones de negociación del texto original con el usuario del sistema implican una interacción que también puede ayudar a preparar un texto más correcto, es decir, a preeditarlo (véase el apartado ) para que pueda ser traducido automáticamente.

source: Aquesta idea es va reforçar pel fet que van començar a aparèixer millores significatives en el maquinari, els primers llenguatges de programació i moltes millores en la lingüística formal (especialment en l'àrea de la sintaxi).
es_es: Esta idea se reforzó por el hecho de que comenzaron a aparecer mejoras significativas en el hardware, los primeros lenguajes de programación y muchas mejoras en la lingüística formal (especialmente en el área de la sintaxis).

source: Aquesta manca de recursos va fer que els primers objectius foren molt modests i, així, els primers investigadors van concentrar-se en el desenvolupament de llenguatges controlats (vegeu ) i en l'ajuda humana en tasques de preedició i postedició (vegeu ); era prou clar que els sistemes reals no podrien produir més que traduccions de molt baixa qualitat.
es_es: Esta carencia de recursos hizo que los primeros objetivos fueran muy modestos y, así, los primeros investigadores se concentraron en el desarrollo de lenguajes controlados (véase ) y en la ayuda humana en tareas de preedición y postedición (véase ); está bastante claro que los sistemas reales no podrían producir más que traducciones de muy baja calidad.

source: Aquesta noció, que pot semblar polèmica, no ho és tant: qui tradueix com a professional un manual de mecànica de l'automòbil o un text de física teòrica ho pot fer sense haver d'entendre completament les disciplines corresponents.
es_es: Esta noción, que puede parecer polémica, no lo es tanto: quien traduce como profesional un manual de mecánica del automóvil o un texto de física teórica lo puede hacer sin tener que entender completamente las disciplinas correspondientes.

source: Aquesta taula indica què cal fer en cada pas de l'anàlisi.
es_es: Esta tabla indica qué hay que hacer en cada paso del análisis.

source: Aquesta és una situació de{} {} postedició.
es_es: Esta es una situación de{} {} postedición.

source: Aquesta és una situació de preedició.
es_es: Esta es una situación de preedición.

source: Aquestes aproximacions inductives també reben el nom de traducció automàtica basada en corpus.
es_es: Estas aproximaciones inductivas también reciben el nombre de traducción automática basada en corpus.

source: Aquestes deficiències es mitiguen parcialment amb l'ús d'un model de la LM.
es_es: Estas deficiencias se mitigan parcialmente con el uso de un modelo de la LM.

source: Aquestes operacions es poden resoldre de manera natural en un sistema de transferència sintàctica.
es_es: Estas operaciones se pueden resolver de manera natural en un sistema de transferencia sintáctica.

source: Aquestes oracions paral·leles són: yn pifo--gur ubhfo, yn pifo oynapi--gur juvga ubhfo i yn sybe--gur subjre.
es_es: Estas oraciones paralelas son: yn pifo--gur ubhfo, yn pifo oynapi--gur juvga ubhfo i yn sybe--gur subjre.

source: Aquests sistemes també es poden veure com el resultat d'una sèrie de refinaments inevitables sobre un sistema de traducció mot per mot (vegeu l'apartat ), és a dir, com una sèrie d'operacions addicionals que s'han de fer a més d'anar substituint cada mot per un equivalent constant.
es_es: Estos sistemas también se pueden ver como el resultado de una serie de refinamientos inevitables sobre un sistema de traducción palabra por palabra (véase el apartado ), es decir, como una serie de operaciones adicionales que se tienen que hacer además de ir sustituyendo cada palabra por un equivalente constante.

source: Ara, pensem què li succeiria a ``tall truck driver''.
es_es: Ahora, pensemos qué le sucedería a ``tall truck driver''.

source: Ara, però, el descobriment de noves tècniques va fer possible projectes com Candide a IBM.
es_es: Por otro lado, el descubrimiento de nuevas técnicas hizo posible proyectos como Candide a IBM.

source: Assenyaleu quina seria la traducció del sistema per a totes les oracions anteriors usant el conjunt de regles que heu proposat.
es_es: Señalad cuál sería la traducción del sistema para todas las oraciones anteriores usando el conjunto de reglas que habéis propuesto.

source: Automatització del procés de traducció
es_es: Automatización del proceso de traducción

source: Avantatges d'interlingua: són necessaris menys mòduls nous quan s'afig una llengua nova al sistema (només un d'anàlisi i un de generació).
es_es: Ventajas de interlingua: son necesarios menos módulos nuevos cuando se añade una lengua nueva al sistema (sólo uno de análisis y uno de generación).

source: Boxealarien izenak apuntatu zituen.} es pot traduir mot per mot com: { El-dinar acabat després Koldo al-diari anat era i de-Teo foto una pres l'havia.
es_es: Boxealarien izenak apuntatu zituen.} se puede traducir palabra por palabra como: { El-dinar acabat després Koldo al-diari anat era i de-Teo foto una pres l'havia.

source: Calia reduir al mínim la intervenció humana en el procés de TA, fins assolir la independència total i una qualitat comparable a la dels humans.
es_es: Había que reducir al mínimo la intervención humana en el proceso de TA, hasta lograr la independencia total y una calidad comparable a la de los humanos.
